[
  {
    "title": "Harry Potter and the Philosopher's Stone",
    "description": "It is a story about Harry Potter, an orphan brought up by his aunt and uncle because his parents were killed when he was a baby. Harry is unloved by his uncle and aunt but everything changes when he is invited to join Hogwarts School of Witchcraft and Wizardry and he finds out he's a wizard.",
    "author": {
      "name": "J. K. Rowling",
      "yearOfBirth": 1965
    },
    "ISBN": "978-0-7475-3269-9",
    "published": 1997,
    "publisher": "Bloomsbury"
  },
  {
    "title": "Garis Waktu",
    "description": "Garis Waktu adalah novel karya Fiersa Besari pada tahun 2016 yang diterbitkan oleh Media Kita. Pada tahun 2021, novel ini diadaptasi menjadi sebuah film oleh Dapur Film dan MD Pictures dengan judul sama",
    "author": {
      "name": "Fiersa Besari",
      "yearOfBirth": 1984
    },
    "ISBN": "978-979-794-525-1",
    "published": 2016,
    "publisher": "Media Kita"
  },
  {
    "title": "One Piece, Vol. 1: Romance Dawn",
    "description": "Join Monkey D. Luffy and his swashbuckling crew in their search for the ultimate treasure, One Piece! As a child, Monkey D. Luffy dreamed of becoming King of the Pirates. But his life changed when he accidentally gained the power to stretch like rubber…at the cost of never being able to swim again! Years, later, Luffy sets off in search of the “One Piece,” said to be the greatest treasure in the world... As a child, Monkey D. Luffy was inspired to become a pirate by listening to the tales of the buccaneer 'Red-Haired' Shanks. But his life changed when Luffy accidentally ate the Gum-Gum Devil Fruit and gained the power to stretch like rubber...at the cost of never being able to swim again! Years later, still vowing to become the king of the pirates, Luffy sets out on his adventure...one guy alone in a rowboat, in search of the legendary 'One Piece', said to be the greatest treasure in the world...",
    "author": {
      "name": "Eiichiro Oda",
      "yearOfBirth": 1975
    },
    "ISBN": "978-1569319017",
    "published": 2003,
    "publisher": "VIZ Media LLC"
  }
]
